[
  {
    "image": "https://images-na.ssl-images-amazon.com/images/I/61jrneRBvdS.jpg",
    "title": "The Politics of Design",
    "author": "Ruben Pater",
    "yearPublished": "2016",
    "id": 0,
    "description" : "The Politics of Design explores the cultural and political context of the typography, colours, photography, symbols, and information graphics that we use every day. Designers, communication specialists, and image-makers possess the power to shape visual communication, and with that power comes great responsibility."
  },
  {
    "image": "https://www.valiz.nl/images/publicaties/CAPS_LOCK/CAPS-LOCK-FrontCover-isbn978-94-02095-81-7-Valiz_NEW-VERSION-FROM-RUBEN.jpg",
    "title": "Caps Lock",
    "author": "Ruben Pater",
    "yearPublished": "2021",
    "id": 1,
    "description" : "Capitalism could not exist without the coins, banknotes, documents, information graphics, interfaces, branding, and advertisements made by graphic designers. Even anti-consumerist strategies such as social design and speculative design are appropriated to serve economic growth. It seems design is locked in a cycle of exploitation and extraction, furthering inequality and environmental collapse. CAPS LOCK uses clear language and visual examples to show how graphic design and capitalism are inextricably linked. The book features designed objects and also examines how the study, work, and professional practice of designers support the market economy. Six radical design cooperatives are featured that resist capitalist thinking in their own way, hoping to inspire a more socially aware graphic design."
  },
  {
    "image": "https://images-na.ssl-images-amazon.com/images/I/615VxqyHbbL.jpg",
    "title": "Typographie",
    "author": "Emil Ruder",
    "yearPublished": "1967",
    "id": 2,
    "description" : "This book is the legacy of Emil Ruder, one of the originators of Swiss Style, famous throughout the world for the use of asymmetric layouts, use of a grid, sans-serif typefaces and flush left, ragged right text. His holistic approach is still recognized as fundamental for graphic designers and typographers all over the world. The volume is a comprehensive masterpiece seen in its overall structure: in the themes presented, in the comparison of similarities and contrasts, in the richness of the illustrations and the harmoniously inserted types. Behind the purely pedagogic examples of exact proportions, a rich, philosophical thinking shines through. Today, fifty years after this book was first published, it is still widely used and referenced."
  },
  {
    "image": "https://images-na.ssl-images-amazon.com/images/I/910lSDI+B1L.jpg",
    "title": "Re-Printed Matter",
    "author": "Karel Martens",
    "yearPublished": "2019",
    "id": 3,
    "description": "Karel Martens occupies an intriguing place in the current European landscape of art and design. His work is both personal and experimental, but also publicly answerable. Martens, a prolific book designer, has also contributed to a wide range of design commissions, including stamps, coins, and signs. His artistic practice is intimately connected with this design work, from geometric and kinetic constructions, to works on paper and monoprints. Covering almost 60 years of practice and now in its fourth edition, this book offers new ways to look at and discuss the output of this designer and artist, and is offered in the same spirit of experiment and dialogue that characterises the work it presents."
  },
  {
    "image": "https://images-na.ssl-images-amazon.com/images/I/51pppDiqJzL._SX364_BO1,204,203,200_.jpg",
    "title": "Forget all the rules about graphic design.",
    "author": "Bob Gill",
    "yearPublished": "1985",
    "id": 4,
    "description": "Forget how good design is supposed to look. What you think is good design, is what other designers think is good design too. That's why design is in a rut. And that's not good. That's boring. This book is about how to get out of that rut; how to take an ordinary graphic problem and turn it into an original graphic solution. The 146 examples of the wit and imagination of Gill's solutions to the graphic problems in this unique collection are remarkable. But the most remarkable thing is that although 30 years of his work is represented here, you won't be able to tell Gill's early designs from his most recent ones."
  },
  {
    "image": "https://images-na.ssl-images-amazon.com/images/I/81Q+1HpVgzL.jpg",
    "title": "Graphic Design: Now in Production",
    "author": "Ellen Lupton, Andrew Blauvelt",
    "yearPublished": "2011",
    "id": 5,
    "description": "Featuring work produced since 2000, Graphic Design: Now in Production explores the worlds of design-driven magazines, newspapers, books and posters; the entrepreneurial spirit of designer-produced goods; the renaissance in digital typeface design; the storytelling potential of film and television titling sequences; and the transformation of raw data into compelling information narratives."
  },
  {
    "image": "https://images-na.ssl-images-amazon.com/images/I/71PUN7wCDcL.jpg",
    "title": "White",
    "author": "Kenya Hara",
    "yearPublished": "2009",
    "id": 6,
    "description": "“White” is not a book about colors. It is rather Kenya Haras attempt to explore the essence of “White,” which he sees as being closely related to the origin of Japanese aesthetics – symbolizing simplicity and subtlety. The central concepts discussed by Kenya Hara in this publication are emptiness and the absolute void. Kenya Hara also sees his work as a designer as a form of communication. Good communication has the distinction of being able to listen to each other, rather than to press one’s opinion onto the opponent. Kenya Hara compares this form of communication with an “empty container”. In visual communication, there are equally signals whose signification is limited, as well as signals or symbols such as the cross or the red circle on the Japanese flag, which – like an “empty container” – permit every signification and do not limit imagination. Not alone the fact that the Japanese character for white forms a radical of the character for emptiness has prompted him the closely associate the color white with emptiness."
  }
]